Revit 2026 API

# IntersectionResultArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IntersectionResultArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
IntersectionResultArrayIterator()
```
```fsharp
new : unit -> IntersectionResultArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

IntersectionResultArrayIterator Class

Autodesk.Revit.DB Namespace